var Data = {

	NEIHU: {
		text: '內湖線通車時',
		llist: {
			R: '淡水線', G: '新店線', BL: '板南線', BR: '文湖線', O3: '中和線', G1: '小南門線', G2: '小碧潭支線', R1: '新北投支線', X: '接駁公車'
		},
		dlist: {
			// 淡水線
			'R32-R33': {d: 2062, l: 'R'}, 'R31-R32': {d: 1935, l: 'R'}, 'R30-R31': {d: 2050, l: 'R'}, 'R29-R30': {d: 880, l: 'R'},
			'R28-R29': {d: 1441, l: 'R'}, 'R26-R28': {d: 1621, l: 'R'}, 'R25-R26': {d: 761, l: 'R'}, 'R24-R25': {d: 851, l: 'R'},
			'R23-R24': {d: 1240, l: 'R'}, 'R22-R23': {d: 610, l: 'R'}, 'R21-R22': {d: 887, l: 'R'}, 'R20-R21': {d: 980, l: 'R'},
			'R18A-R20': {d: 1191, l: 'R'}, 'R17-R18A': {d: 1519, l: 'R'}, 'R16-R17': {d: 1020, l: 'R'}, 'R15-R16': {d: 559, l: 'R'},
			'R14-R15': {d: 543, l: 'R'}, 'R13-R14': {d: 630, l: 'R'}, 'R12-R13': {d: 630, l: 'R'}, 'R11-R12': {d: 950, l: 'R'},
			// 新北投支線
			'R26-R27': {d: 1030, l: 'R1'},
			// 板南線
			'BL17-BL18': {d: 0, l: 'X'},
			'BL16-BL17': {d: 1185, l: 'BL'}, 'BL15-BL16': {d: 1310, l: 'BL'}, 'BL14-BL15': {d: 817, l: 'BL'},
			'BL13-BL14': {d: 1135, l: 'BL'}, 'BL12-BL13': {d: 850, l: 'BL'}, 'BL11-BL12': {d: 719, l: 'BL'}, 'BL10-BL11': {d: 666, l: 'BL'},
			'BL10-BL9': {d: 1129, l: 'BL'}, 'BL8-BL9': {d: 943, l: 'BL'}, 'BL8-R13': {d: 671, l: 'BL'}, 'BL6-R13': {d: 1431, l: 'BL'},
			'BL5-BL6': {d: 1268, l: 'BL'}, 'BL4-BL5': {d: 3079, l: 'BL'}, 'BL3-BL4': {d: 866, l: 'BL'}, 'BL2-BL3': {d: 1274, l: 'BL'},
			'BL1-BL2': {d: 653, l: 'BL'}, 'BL1-BL40': {d: 1314, l: 'BL'}, 'BL39-BL40': {d: 902, l: 'BL'}, 'BL38-BL39': {d: 1463, l: 'BL'}, 'BL37-BL38': {d: 1129, l: 'BL'},
			// 中和線
			'O15-O16': {d: 2156, l: 'O3'}, 'O16-O17': {d: 1300, l: 'O3'}, 'O17-O18': {d: 1150, l: 'O3'}, 'O18-O19': {d: 692, l: 'O3'}, 
			// 小南門線
			'BL6-G12': {d: 756, l: 'G1'}, 'G12-R11': {d: 822, l: 'G1'}, 
			// 新店線
			'O15-R11': {d: 1165, l: 'R'},
			'G9-O15': {d: 640, l: 'G'}, 'G7-G9': {d: 900, l: 'G'}, 'G6-G7': {d: 1560, l: 'G'},
			'G5-G6': {d: 1070, l: 'G'}, 'G4-G5': {d: 1150, l: 'G'}, 'G3-G4': {d: 850, l: 'G'}, 'G2-G3': {d: 900, l: 'G'}, 'G1-G2': {d: 1115, l: 'G'},
			// 小碧潭支線
			'G1A-G3': {d: 2500, l: 'G2'}, 
			// 文山內湖線
			'B10-BL18': {d: 600, l: 'BR'}, 'B10-B9': {d: 1010, l: 'BR'}, 'B8-B9': {d: 890, l: 'BR'}, 'B7-B8': {d: 1630, l: 'BR'}, 'B6-B7': {d: 870, l: 'BR'},
			'B5-B6': {d: 1130, l: 'BR'}, 'B4-B5': {d: 1010, l: 'BR'}, 'B3-B4': {d: 830, l: 'BR'}, 'B2-B3': {d: 1290, l: 'BR'}, 'B1-B2': {d: 1330, l: 'BR'},
			'B1-BR1': {d: 2580, l: 'BR'}, 'BR1-BR2': {d: 1480, l: 'BR'}, 'BR2-G18': {d: 1050, l: 'BR'},'BL10-G18': {d: 1150, l: 'BR'},
			'BL10-R08': {d: 900, l: 'BR'}, 'BR6-R08': {d: 751, l: 'BR'}, 'BR6-BR7': {d: 1130, l: 'BR'}, 'BR7-BR8': {d: 800, l: 'BR'},
			'BR8-BR9': {d: 1550, l: 'BR'}, 'BR10-BR9': {d: 750, l: 'BR'}, 'BR10-BR11': {d: 1200, l: 'BR'}, 'BR11-BR12': {d: 590, l: 'BR'}, 'BR12-BR13': {d: 805, l: 'BR'},
		},
		isTransfer: function(a, b) {
			if (b < a) { var tmp = a; a = b; b = tmp; }

			if (a == 'O3' && b == 'R') return false;
			if (a == 'G' && b == 'R') return false;
			return a != b;
		}
	},

	XINZHUANG: {
		text: '新莊線新莊段通車時',
		llist: {
			R: '淡水線', G: '新店線', BL: '板南線', BR: '文湖線', O: '新蘆線', O1: '新蘆線', O2: '新蘆線', O3: '中和線', G1: '小南門線', G2: '小碧潭支線', R1: '新北投支線'
		},
		dlist: {
			// 淡水線
			'R32-R33': {d: 2062, l: 'R'}, 'R31-R32': {d: 1935, l: 'R'}, 'R30-R31': {d: 2050, l: 'R'}, 'R29-R30': {d: 880, l: 'R'},
			'R28-R29': {d: 1441, l: 'R'}, 'R26-R28': {d: 1621, l: 'R'}, 'R25-R26': {d: 761, l: 'R'}, 'R24-R25': {d: 851, l: 'R'},
			'R23-R24': {d: 1240, l: 'R'}, 'R22-R23': {d: 610, l: 'R'}, 'R21-R22': {d: 887, l: 'R'}, 'R20-R21': {d: 980, l: 'R'},
			'R18A-R20': {d: 1191, l: 'R'}, 'R17-R18A': {d: 1519, l: 'R'}, 'R16-R17': {d: 1020, l: 'R'}, 'R15-R16': {d: 559, l: 'R'},
			'R14-R15': {d: 543, l: 'R'}, 'R13-R14': {d: 630, l: 'R'}, 'R12-R13': {d: 630, l: 'R'}, 'R11-R12': {d: 950, l: 'R'},
			// 新北投支線
			'R26-R27': {d: 1030, l: 'R1'},
			// 板南線
			'BL17-BL18': {d: 1130, l: 'BL'}, 'BL16-BL17': {d: 1185, l: 'BL'}, 'BL15-BL16': {d: 1310, l: 'BL'}, 'BL14-BL15': {d: 817, l: 'BL'},
			'BL13-BL14': {d: 1135, l: 'BL'}, 'BL12-BL13': {d: 850, l: 'BL'}, 'BL11-BL12': {d: 719, l: 'BL'}, 'BL10-BL11': {d: 666, l: 'BL'},
			'BL10-BL9': {d: 1129, l: 'BL'}, 'BL8-BL9': {d: 943, l: 'BL'}, 'BL8-R13': {d: 671, l: 'BL'}, 'BL6-R13': {d: 1431, l: 'BL'},
			'BL5-BL6': {d: 1268, l: 'BL'}, 'BL4-BL5': {d: 3079, l: 'BL'}, 'BL3-BL4': {d: 866, l: 'BL'}, 'BL2-BL3': {d: 1274, l: 'BL'},
			'BL1-BL2': {d: 653, l: 'BL'}, 'BL1-BL40': {d: 1314, l: 'BL'}, 'BL39-BL40': {d: 902, l: 'BL'}, 'BL38-BL39': {d: 1463, l: 'BL'}, 'BL37-BL38': {d: 1129, l: 'BL'},
			// 中和新蘆線 (新莊線)
		//	'O59-O60': {d: 1295, l: 'O1'}, 'O1-O60': {d: 1247, l: 'O1'}, 
			'O1-O2': {d: 1826, l: 'O1'}, 'O2-O3': {d: 1007, l: 'O1'}, 'O3-O4': {d: 1286, l: 'O1'}, 'O4-O5': {d: 1675, l: 'O1'},
			'O5-O6': {d: 891, l: 'O1'}, 'O6-O7': {d: 1009, l: 'O1'}, 'O7-O8': {d: 1339, l: 'O1'},
			// 中和新蘆線 (蘆洲線)
			'O47-O8': {d: 1877, l: 'O2'}, 'O43-O44': {d: 950, l: 'O2'}, 'O44-O45': {d: 1100, l: 'O2'}, 'O45-O46': {d: 1010, l: 'O2'}, 'O46-O47': {d: 1200, l: 'O2'},
			// 中和新蘆線 (新莊線市區段 + 中和線)
			'O8-R16': {d: 681, l: 'O'}, 'O10-R16': {d: 659, l: 'O'}, 'O10-O11': {d: 924, l: 'O'}, 'O11-O12': {d: 823, l: 'O'}, 'BL9-O12': {d: 1147, l: 'O'},
			'O15-O16': {d: 2156, l: 'O3'}, 'O16-O17': {d: 1300, l: 'O3'}, 'O17-O18': {d: 1150, l: 'O3'}, 'O18-O19': {d: 692, l: 'O3'}, 
			// 小南門線
			'BL6-G12': {d: 756, l: 'G1'}, 'G12-R11': {d: 822, l: 'G1'}, 
			// 新店線
			'O15-R11': {d: 1165, l: 'R'}, 'G9-O15': {d: 640, l: 'G'}, 'G7-G9': {d: 900, l: 'G'}, 'G6-G7': {d: 1560, l: 'G'},
			'G5-G6': {d: 1070, l: 'G'}, 'G4-G5': {d: 1150, l: 'G'}, 'G3-G4': {d: 850, l: 'G'}, 'G2-G3': {d: 900, l: 'G'}, 'G1-G2': {d: 1115, l: 'G'},
			// 小碧潭支線
			'G1A-G3': {d: 2500, l: 'G2'}, 
			// 文山內湖線
			'B10-BL18': {d: 600, l: 'BR'}, 'B10-B9': {d: 1010, l: 'BR'}, 'B8-B9': {d: 890, l: 'BR'}, 'B7-B8': {d: 1630, l: 'BR'}, 'B6-B7': {d: 870, l: 'BR'},
			'B5-B6': {d: 1130, l: 'BR'}, 'B4-B5': {d: 1010, l: 'BR'}, 'B3-B4': {d: 830, l: 'BR'}, 'B2-B3': {d: 1290, l: 'BR'}, 'B1-B2': {d: 1330, l: 'BR'},
			'B1-BR1': {d: 2580, l: 'BR'}, 'BR1-BR2': {d: 1480, l: 'BR'}, 'BR2-G18': {d: 1050, l: 'BR'},'BL10-G18': {d: 1150, l: 'BR'},
			'BL10-R08': {d: 900, l: 'BR'}, 'BR6-R08': {d: 751, l: 'BR'}, 'BR6-BR7': {d: 1130, l: 'BR'}, 'BR7-BR8': {d: 800, l: 'BR'},
			'BR8-BR9': {d: 1550, l: 'BR'}, 'BR10-BR9': {d: 750, l: 'BR'}, 'BR10-BR11': {d: 1200, l: 'BR'}, 'BR11-BR12': {d: 590, l: 'BR'}, 'BR12-BR13': {d: 805, l: 'BR'},
		},
		isTransfer: function(a, b) {
			if (b < a) { var tmp = a; a = b; b = tmp; }

			if (a == 'O3' && b == 'R') return false;
			if (a == 'G' && b == 'R') return false;
			if (a == 'O' && b == 'O1') return false;
			if (a == 'O' && b == 'O2') return false;
			return a != b;
		}
	},

	DONGMEN: {
		text: '東門段通車時',
		llist: {
			R: '淡水線', G: '新店線', BL: '板南線', BR: '文湖線', O: '中和新蘆線', O1: '中和新蘆線', O2: '中和新蘆線', G1: '小南門線', G2: '小碧潭支線', R1: '新北投支線'
		},
		dlist: {
			// 淡水線
			'R32-R33': {d: 2062, l: 'R'}, 'R31-R32': {d: 1935, l: 'R'}, 'R30-R31': {d: 2050, l: 'R'}, 'R29-R30': {d: 880, l: 'R'},
			'R28-R29': {d: 1441, l: 'R'}, 'R26-R28': {d: 1621, l: 'R'}, 'R25-R26': {d: 761, l: 'R'}, 'R24-R25': {d: 851, l: 'R'},
			'R23-R24': {d: 1240, l: 'R'}, 'R22-R23': {d: 610, l: 'R'}, 'R21-R22': {d: 887, l: 'R'}, 'R20-R21': {d: 980, l: 'R'},
			'R18A-R20': {d: 1191, l: 'R'}, 'R17-R18A': {d: 1519, l: 'R'}, 'R16-R17': {d: 1020, l: 'R'}, 'R15-R16': {d: 559, l: 'R'},
			'R14-R15': {d: 543, l: 'R'}, 'R13-R14': {d: 630, l: 'R'}, 'R12-R13': {d: 630, l: 'R'}, 'R11-R12': {d: 950, l: 'R'},
			// 新北投支線
			'R26-R27': {d: 1030, l: 'R1'},
			// 板南線
			'BL17-BL18': {d: 1130, l: 'BL'}, 'BL16-BL17': {d: 1185, l: 'BL'}, 'BL15-BL16': {d: 1310, l: 'BL'}, 'BL14-BL15': {d: 817, l: 'BL'},
			'BL13-BL14': {d: 1135, l: 'BL'}, 'BL12-BL13': {d: 850, l: 'BL'}, 'BL11-BL12': {d: 719, l: 'BL'}, 'BL10-BL11': {d: 666, l: 'BL'},
			'BL10-BL9': {d: 1129, l: 'BL'}, 'BL8-BL9': {d: 943, l: 'BL'}, 'BL8-R13': {d: 671, l: 'BL'}, 'BL6-R13': {d: 1431, l: 'BL'},
			'BL5-BL6': {d: 1268, l: 'BL'}, 'BL4-BL5': {d: 3079, l: 'BL'}, 'BL3-BL4': {d: 866, l: 'BL'}, 'BL2-BL3': {d: 1274, l: 'BL'},
			'BL1-BL2': {d: 653, l: 'BL'}, 'BL1-BL40': {d: 1314, l: 'BL'}, 'BL39-BL40': {d: 902, l: 'BL'}, 'BL38-BL39': {d: 1463, l: 'BL'}, 'BL37-BL38': {d: 1129, l: 'BL'},
			// 中和新蘆線 (新莊線)
			'O1-O2': {d: 1826, l: 'O1'}, 'O2-O3': {d: 1007, l: 'O1'}, 'O3-O4': {d: 1286, l: 'O1'}, 'O4-O5': {d: 1675, l: 'O1'},
			'O5-O6': {d: 891, l: 'O1'}, 'O6-O7': {d: 1009, l: 'O1'}, 'O7-O8': {d: 1339, l: 'O1'},
			// 中和新蘆線 (蘆洲線)
			'O47-O8': {d: 1877, l: 'O2'}, 'O43-O44': {d: 950, l: 'O2'}, 'O44-O45': {d: 1100, l: 'O2'}, 'O45-O46': {d: 1010, l: 'O2'}, 'O46-O47': {d: 1200, l: 'O2'},
			// 中和新蘆線 (新莊線市區段 + 中和線)
			'O8-R16': {d: 681, l: 'O'}, 'O10-R16': {d: 659, l: 'O'}, 'O10-O11': {d: 924, l: 'O'}, 'O11-O12': {d: 823, l: 'O'},
			'BL9-O12': {d: 1147, l: 'O'}, 'BL9-R10': {d: 1180, l: 'O'}, 'O15-R10': {d: 1250, l: 'O'}, 'O15-O16': {d: 2156, l: 'O'},
			'O16-O17': {d: 1300, l: 'O'}, 'O17-O18': {d: 1150, l: 'O'}, 'O18-O19': {d: 692, l: 'O'}, 
			// 小南門線
			'BL6-G12': {d: 756, l: 'G1'}, 'G12-R11': {d: 822, l: 'G1'}, 
			// 新店線
			'O15-R11': {d: 1165, l: 'G'}, 'G9-O15': {d: 640, l: 'G'}, 'G7-G9': {d: 900, l: 'G'}, 'G6-G7': {d: 1560, l: 'G'},
			'G5-G6': {d: 1070, l: 'G'}, 'G4-G5': {d: 1150, l: 'G'}, 'G3-G4': {d: 850, l: 'G'}, 'G2-G3': {d: 900, l: 'G'}, 'G1-G2': {d: 1115, l: 'G'},
			// 小碧潭支線
			'G1A-G3': {d: 2500, l: 'G2'}, 
			// 文山內湖線
			'B10-BL18': {d: 600, l: 'BR'}, 'B10-B9': {d: 1010, l: 'BR'}, 'B8-B9': {d: 890, l: 'BR'}, 'B7-B8': {d: 1630, l: 'BR'}, 'B6-B7': {d: 870, l: 'BR'},
			'B5-B6': {d: 1130, l: 'BR'}, 'B4-B5': {d: 1010, l: 'BR'}, 'B3-B4': {d: 830, l: 'BR'}, 'B2-B3': {d: 1290, l: 'BR'}, 'B1-B2': {d: 1330, l: 'BR'},
			'B1-BR1': {d: 2580, l: 'BR'}, 'BR1-BR2': {d: 1480, l: 'BR'}, 'BR2-G18': {d: 1050, l: 'BR'},'BL10-G18': {d: 1150, l: 'BR'},
			'BL10-R08': {d: 900, l: 'BR'}, 'BR6-R08': {d: 751, l: 'BR'}, 'BR6-BR7': {d: 1130, l: 'BR'}, 'BR7-BR8': {d: 800, l: 'BR'},
			'BR8-BR9': {d: 1550, l: 'BR'}, 'BR10-BR9': {d: 750, l: 'BR'}, 'BR10-BR11': {d: 1200, l: 'BR'}, 'BR11-BR12': {d: 590, l: 'BR'}, 'BR12-BR13': {d: 805, l: 'BR'},
		},
		isTransfer: function(a, b) {
			if (b < a) { var tmp = a; a = b; b = tmp; }

			if (a == 'G' && b == 'R') return false;
			if (a == 'O' && b == 'O1') return false;
			if (a == 'O' && b == 'O2') return false;
			return a != b;
		}
	},

	XINYI: {
		text: '信義線通車時',
		llist: {
			R: '淡水信義線', G: '新店線', BL: '板南線', BR: '文湖線', O: '中和新蘆線', O1: '中和新蘆線', O2: '中和新蘆線', G2: '小碧潭支線', R1: '新北投支線'
		},
		dlist: {
			// 淡水線
			'R32-R33': {d: 2062, l: 'R'}, 'R31-R32': {d: 1935, l: 'R'}, 'R30-R31': {d: 2050, l: 'R'}, 'R29-R30': {d: 880, l: 'R'},
			'R28-R29': {d: 1441, l: 'R'}, 'R26-R28': {d: 1621, l: 'R'}, 'R25-R26': {d: 761, l: 'R'}, 'R24-R25': {d: 851, l: 'R'},
			'R23-R24': {d: 1240, l: 'R'}, 'R22-R23': {d: 610, l: 'R'}, 'R21-R22': {d: 887, l: 'R'}, 'R20-R21': {d: 980, l: 'R'},
			'R18A-R20': {d: 1191, l: 'R'}, 'R17-R18A': {d: 1519, l: 'R'}, 'R16-R17': {d: 1020, l: 'R'}, 'R15-R16': {d: 559, l: 'R'},
			'R14-R15': {d: 543, l: 'R'}, 'R13-R14': {d: 630, l: 'R'}, 'R12-R13': {d: 630, l: 'R'}, 'R11-R12': {d: 950, l: 'R'},
			// 信義線
			'R10-R11': {d: 1200, l: 'R'}, 'R09-R10': {d: 657, l: 'R'}, 'R08-R09': {d: 798, l: 'R'}, 'R07-R08': {d: 792, l: 'R'},
			'R06-R07': {d: 1082, l: 'R'}, 'R05-R06': {d: 859, l: 'R'},
			// 新北投支線
			'R26-R27': {d: 1030, l: 'R1'},
			// 板南線
			'BL17-BL18': {d: 1130, l: 'BL'}, 'BL16-BL17': {d: 1185, l: 'BL'}, 'BL15-BL16': {d: 1310, l: 'BL'}, 'BL14-BL15': {d: 817, l: 'BL'},
			'BL13-BL14': {d: 1135, l: 'BL'}, 'BL12-BL13': {d: 850, l: 'BL'}, 'BL11-BL12': {d: 719, l: 'BL'}, 'BL10-BL11': {d: 666, l: 'BL'},
			'BL10-BL9': {d: 1129, l: 'BL'}, 'BL8-BL9': {d: 943, l: 'BL'}, 'BL8-R13': {d: 671, l: 'BL'}, 'BL6-R13': {d: 1431, l: 'BL'},
			'BL5-BL6': {d: 1268, l: 'BL'}, 'BL4-BL5': {d: 3079, l: 'BL'}, 'BL3-BL4': {d: 866, l: 'BL'}, 'BL2-BL3': {d: 1274, l: 'BL'},
			'BL1-BL2': {d: 653, l: 'BL'}, 'BL1-BL40': {d: 1314, l: 'BL'}, 'BL39-BL40': {d: 902, l: 'BL'}, 'BL38-BL39': {d: 1463, l: 'BL'}, 'BL37-BL38': {d: 1129, l: 'BL'},
			// 中和新蘆線 (新莊線)
			'O59-O60': {d: 1295, l: 'O1'}, 'O1-O60': {d: 1247, l: 'O1'}, 
			'O1-O2': {d: 1826, l: 'O1'}, 'O2-O3': {d: 1007, l: 'O1'}, 'O3-O4': {d: 1286, l: 'O1'}, 'O4-O5': {d: 1675, l: 'O1'},
			'O5-O6': {d: 891, l: 'O1'}, 'O6-O7': {d: 1009, l: 'O1'}, 'O7-O8': {d: 1339, l: 'O1'},
			// 中和新蘆線 (蘆洲線)
			'O47-O8': {d: 1877, l: 'O2'}, 'O43-O44': {d: 950, l: 'O2'}, 'O44-O45': {d: 1100, l: 'O2'}, 'O45-O46': {d: 1010, l: 'O2'}, 'O46-O47': {d: 1200, l: 'O2'},
			// 中和新蘆線 (新莊線市區段 + 中和線)
			'O8-R16': {d: 681, l: 'O'}, 'O10-R16': {d: 659, l: 'O'}, 'O10-O11': {d: 924, l: 'O'}, 'O11-O12': {d: 823, l: 'O'},
			'BL9-O12': {d: 1147, l: 'O'}, 'BL9-R10': {d: 1180, l: 'O'}, 'O15-R10': {d: 1250, l: 'O'}, 'O15-O16': {d: 2156, l: 'O'},
			'O16-O17': {d: 1300, l: 'O'}, 'O17-O18': {d: 1150, l: 'O'}, 'O18-O19': {d: 692, l: 'O'}, 
			// 小南門線
			'BL6-G12': {d: 756, l: 'G'}, 'G12-R11': {d: 822, l: 'G'}, 
			// 新店線
			'O15-R11': {d: 1165, l: 'G'}, 'G9-O15': {d: 640, l: 'G'}, 'G7-G9': {d: 900, l: 'G'}, 'G6-G7': {d: 1560, l: 'G'},
			'G5-G6': {d: 1070, l: 'G'}, 'G4-G5': {d: 1150, l: 'G'}, 'G3-G4': {d: 850, l: 'G'}, 'G2-G3': {d: 900, l: 'G'}, 'G1-G2': {d: 1115, l: 'G'},
			// 小碧潭支線
			'G1A-G3': {d: 2500, l: 'G2'}, 
			// 文山內湖線
			'B10-BL18': {d: 600, l: 'BR'}, 'B10-B9': {d: 1010, l: 'BR'}, 'B8-B9': {d: 890, l: 'BR'}, 'B7-B8': {d: 1630, l: 'BR'}, 'B6-B7': {d: 870, l: 'BR'},
			'B5-B6': {d: 1130, l: 'BR'}, 'B4-B5': {d: 1010, l: 'BR'}, 'B3-B4': {d: 830, l: 'BR'}, 'B2-B3': {d: 1290, l: 'BR'}, 'B1-B2': {d: 1330, l: 'BR'},
			'B1-BR1': {d: 2580, l: 'BR'}, 'BR1-BR2': {d: 1480, l: 'BR'}, 'BR2-G18': {d: 1050, l: 'BR'},'BL10-G18': {d: 1150, l: 'BR'},
			'BL10-R08': {d: 900, l: 'BR'}, 'BR6-R08': {d: 751, l: 'BR'}, 'BR6-BR7': {d: 1130, l: 'BR'}, 'BR7-BR8': {d: 800, l: 'BR'},
			'BR8-BR9': {d: 1550, l: 'BR'}, 'BR10-BR9': {d: 750, l: 'BR'}, 'BR10-BR11': {d: 1200, l: 'BR'}, 'BR11-BR12': {d: 590, l: 'BR'}, 'BR12-BR13': {d: 805, l: 'BR'},
		},
		isTransfer: function(a, b) {
			if (b < a) { var tmp = a; a = b; b = tmp; }

			if (a == 'O' && b == 'O1') return false;
			if (a == 'O' && b == 'O2') return false;
			return a != b;
		}
	},
	
	SONGSHAN: {
		text: '松山線通車時',
		llist: {
			BR: '1-文湖線', R: '2-淡水信義線', G: '3-松山新店線', O: '4-中和新蘆線', O1: '4A-中和新蘆線', O2: '4B-中和新蘆線', BL: '5-板南線', G2: '小碧潭支線', R1: '新北投支線'
		},
		dlist: {
			// 淡水線
			'R32-R33': {d: 2062, l: 'R'}, 'R31-R32': {d: 1935, l: 'R'}, 'R30-R31': {d: 2050, l: 'R'}, 'R29-R30': {d: 880, l: 'R'},
			'R28-R29': {d: 1441, l: 'R'}, 'R26-R28': {d: 1621, l: 'R'}, 'R25-R26': {d: 761, l: 'R'}, 'R24-R25': {d: 851, l: 'R'},
			'R23-R24': {d: 1240, l: 'R'}, 'R22-R23': {d: 610, l: 'R'}, 'R21-R22': {d: 887, l: 'R'}, 'R20-R21': {d: 980, l: 'R'},
			'R18A-R20': {d: 1191, l: 'R'}, 'R17-R18A': {d: 1519, l: 'R'}, 'R16-R17': {d: 1020, l: 'R'}, 'R15-R16': {d: 559, l: 'R'},
			'R14-R15': {d: 543, l: 'R'}, 'R13-R14': {d: 630, l: 'R'}, 'R12-R13': {d: 630, l: 'R'}, 'R11-R12': {d: 950, l: 'R'},
			// 信義線
			'R10-R11': {d: 1200, l: 'R'}, 'R09-R10': {d: 657, l: 'R'}, 'R08-R09': {d: 798, l: 'R'}, 'R07-R08': {d: 792, l: 'R'},
			'R06-R07': {d: 1082, l: 'R'}, 'R05-R06': {d: 859, l: 'R'},
			// 新北投支線
			'R26-R27': {d: 1030, l: 'R1'},
			// 板南線
			'BL17-BL18': {d: 1130, l: 'BL'}, 'BL16-BL17': {d: 1185, l: 'BL'}, 'BL15-BL16': {d: 1310, l: 'BL'}, 'BL14-BL15': {d: 817, l: 'BL'},
			'BL13-BL14': {d: 1135, l: 'BL'}, 'BL12-BL13': {d: 850, l: 'BL'}, 'BL11-BL12': {d: 719, l: 'BL'}, 'BL10-BL11': {d: 666, l: 'BL'},
			'BL10-BL9': {d: 1129, l: 'BL'}, 'BL8-BL9': {d: 943, l: 'BL'}, 'BL8-R13': {d: 671, l: 'BL'}, 'BL6-R13': {d: 1431, l: 'BL'},
			'BL5-BL6': {d: 1268, l: 'BL'}, 'BL4-BL5': {d: 3079, l: 'BL'}, 'BL3-BL4': {d: 866, l: 'BL'}, 'BL2-BL3': {d: 1274, l: 'BL'},
			'BL1-BL2': {d: 653, l: 'BL'}, 'BL1-BL40': {d: 1314, l: 'BL'}, 'BL39-BL40': {d: 902, l: 'BL'}, 'BL38-BL39': {d: 1463, l: 'BL'}, 'BL37-BL38': {d: 1129, l: 'BL'},
			// 中和新蘆線 (新莊線)
			'O59-O60': {d: 1295, l: 'O1'}, 'O1-O60': {d: 1247, l: 'O1'}, 
			'O1-O2': {d: 1826, l: 'O1'}, 'O2-O3': {d: 1007, l: 'O1'}, 'O3-O4': {d: 1286, l: 'O1'}, 'O4-O5': {d: 1675, l: 'O1'},
			'O5-O6': {d: 891, l: 'O1'}, 'O6-O7': {d: 1009, l: 'O1'}, 'O7-O8': {d: 1339, l: 'O1'},
			// 中和新蘆線 (蘆洲線)
			'O47-O8': {d: 1877, l: 'O2'}, 'O43-O44': {d: 950, l: 'O2'}, 'O44-O45': {d: 1100, l: 'O2'}, 'O45-O46': {d: 1010, l: 'O2'}, 'O46-O47': {d: 1200, l: 'O2'},
			// 中和新蘆線 (新莊線市區段 + 中和線)
			'O8-R16': {d: 681, l: 'O'}, 'O10-R16': {d: 659, l: 'O'}, 'O10-O11': {d: 924, l: 'O'}, 'O11-O12': {d: 823, l: 'O'},
			'BL9-O12': {d: 1147, l: 'O'}, 'BL9-R10': {d: 1180, l: 'O'}, 'O15-R10': {d: 1250, l: 'O'}, 'O15-O16': {d: 2156, l: 'O'},
			'O16-O17': {d: 1300, l: 'O'}, 'O17-O18': {d: 1150, l: 'O'}, 'O18-O19': {d: 692, l: 'O'}, 
			// 松山線
			'G21-G22': {d: 1339, l: 'G'}, 'G19-G21': {d: 1053, l: 'G'}, 'G18A-G19': {d: 1014, l: 'G'}, 'G18A-O12': {d: 1072, l: 'G'},
			'O12-R14': {d: 1315, l: 'G'}, 'G14-R14': {d: 1201, l: 'G'}, 'BL6-G14': {d: 836, l: 'G'}, 
			// 小南門線
			'BL6-G12': {d: 756, l: 'G'}, 'G12-R11': {d: 822, l: 'G'}, 
			// 新店線
			'O15-R11': {d: 1165, l: 'G'}, 'G9-O15': {d: 640, l: 'G'}, 'G7-G9': {d: 900, l: 'G'}, 'G6-G7': {d: 1560, l: 'G'},
			'G5-G6': {d: 1070, l: 'G'}, 'G4-G5': {d: 1150, l: 'G'}, 'G3-G4': {d: 850, l: 'G'}, 'G2-G3': {d: 900, l: 'G'}, 'G1-G2': {d: 1115, l: 'G'},
			// 小碧潭支線
			'G1A-G3': {d: 2500, l: 'G2'}, 
			// 文山內湖線
			'B10-BL18': {d: 600, l: 'BR'}, 'B10-B9': {d: 1010, l: 'BR'}, 'B8-B9': {d: 890, l: 'BR'}, 'B7-B8': {d: 1630, l: 'BR'}, 'B6-B7': {d: 870, l: 'BR'},
			'B5-B6': {d: 1130, l: 'BR'}, 'B4-B5': {d: 1010, l: 'BR'}, 'B3-B4': {d: 830, l: 'BR'}, 'B2-B3': {d: 1290, l: 'BR'}, 'B1-B2': {d: 1330, l: 'BR'},
			'B1-BR1': {d: 2580, l: 'BR'}, 'BR1-BR2': {d: 1480, l: 'BR'}, 'BR2-G18A': {d: 1050, l: 'BR'},'BL10-G18A': {d: 1150, l: 'BR'},
			'BL10-R08': {d: 900, l: 'BR'}, 'BR6-R08': {d: 751, l: 'BR'}, 'BR6-BR7': {d: 1130, l: 'BR'}, 'BR7-BR8': {d: 800, l: 'BR'},
			'BR8-BR9': {d: 1550, l: 'BR'}, 'BR10-BR9': {d: 750, l: 'BR'}, 'BR10-BR11': {d: 1200, l: 'BR'}, 'BR11-BR12': {d: 590, l: 'BR'}, 'BR12-BR13': {d: 805, l: 'BR'},
		},
		isTransfer: function(a, b) {
			if (b < a) { var tmp = a; a = b; b = tmp; }

			if (a == 'O' && b == 'O1') return false;
			if (a == 'O' && b == 'O2') return false;
			return a != b;
		}
	},
	
	ALL: {
		text: '環狀線西環段通車時',
		llist: {
			R: '淡水信義線', G: '新店松山線', BL: '板南線', BR: '文湖線', O: '中和新蘆線', O1: '中和新蘆線', O2: '中和新蘆線', Y: '環狀線', G2: '小碧潭支線', R1: '新北投支線'
		},
		dlist: {
			// 淡水線
			'R32-R33': {d: 2062, l: 'R'}, 'R31-R32': {d: 1935, l: 'R'}, 'R30-R31': {d: 2050, l: 'R'}, 'R29-R30': {d: 880, l: 'R'},
			'R28-R29': {d: 1441, l: 'R'}, 'R26-R28': {d: 1621, l: 'R'}, 'R25-R26': {d: 761, l: 'R'}, 'R24-R25': {d: 851, l: 'R'},
			'R23-R24': {d: 1240, l: 'R'}, 'R22-R23': {d: 610, l: 'R'}, 'R21-R22': {d: 887, l: 'R'}, 'R20-R21': {d: 980, l: 'R'},
			'R18A-R20': {d: 1191, l: 'R'}, 'R17-R18A': {d: 1519, l: 'R'}, 'R16-R17': {d: 1020, l: 'R'}, 'R15-R16': {d: 559, l: 'R'},
			'R14-R15': {d: 543, l: 'R'}, 'R13-R14': {d: 630, l: 'R'}, 'R12-R13': {d: 630, l: 'R'}, 'R11-R12': {d: 950, l: 'R'},
			// 信義線
			'R10-R11': {d: 1200, l: 'R'}, 'R09-R10': {d: 657, l: 'R'}, 'R08-R09': {d: 798, l: 'R'}, 'R07-R08': {d: 792, l: 'R'},
			'R06-R07': {d: 1082, l: 'R'}, 'R05-R06': {d: 859, l: 'R'},
			// 新北投支線
			'R26-R27': {d: 1030, l: 'R1'},
			// 板南線
			'BL17-BL18': {d: 1130, l: 'BL'}, 'BL16-BL17': {d: 1185, l: 'BL'}, 'BL15-BL16': {d: 1310, l: 'BL'}, 'BL14-BL15': {d: 817, l: 'BL'},
			'BL13-BL14': {d: 1135, l: 'BL'}, 'BL12-BL13': {d: 850, l: 'BL'}, 'BL11-BL12': {d: 719, l: 'BL'}, 'BL10-BL11': {d: 666, l: 'BL'},
			'BL10-BL9': {d: 1129, l: 'BL'}, 'BL8-BL9': {d: 943, l: 'BL'}, 'BL8-R13': {d: 671, l: 'BL'}, 'BL6-R13': {d: 1431, l: 'BL'},
			'BL5-BL6': {d: 1268, l: 'BL'}, 'BL4-BL5': {d: 3079, l: 'BL'}, 'BL3-BL4': {d: 866, l: 'BL'}, 'BL2-BL3': {d: 1274, l: 'BL'},
			'BL1-BL2': {d: 653, l: 'BL'}, 'BL1-BL40': {d: 1314, l: 'BL'}, 'BL39-BL40': {d: 902, l: 'BL'}, 'BL38-BL39': {d: 1463, l: 'BL'}, 'BL37-BL38': {d: 1129, l: 'BL'},
			// 中和新蘆線 (新莊線)
			'O59-O60': {d: 1295, l: 'O1'}, 'O1-O60': {d: 1247, l: 'O1'}, 
			'O1-O2': {d: 1826, l: 'O1'}, 'O2-O3': {d: 1007, l: 'O1'}, 'O3-O4': {d: 1286, l: 'O1'}, 'O4-O5': {d: 1675, l: 'O1'},
			'O5-O6': {d: 891, l: 'O1'}, 'O6-O7': {d: 1009, l: 'O1'}, 'O7-O8': {d: 1339, l: 'O1'},
			// 中和新蘆線 (蘆洲線)
			'O47-O8': {d: 1877, l: 'O2'}, 'O43-O44': {d: 950, l: 'O2'}, 'O44-O45': {d: 1100, l: 'O2'}, 'O45-O46': {d: 1010, l: 'O2'}, 'O46-O47': {d: 1200, l: 'O2'},
			// 中和新蘆線 (新莊線市區段 + 中和線)
			'O8-R16': {d: 681, l: 'O'}, 'O10-R16': {d: 659, l: 'O'}, 'O10-O11': {d: 924, l: 'O'}, 'O11-O12': {d: 823, l: 'O'},
			'BL9-O12': {d: 1147, l: 'O'}, 'BL9-R10': {d: 1180, l: 'O'}, 'O15-R10': {d: 1250, l: 'O'}, 'O15-O16': {d: 2156, l: 'O'},
			'O16-O17': {d: 1300, l: 'O'}, 'O17-O18': {d: 1150, l: 'O'}, 'O18-O19': {d: 692, l: 'O'}, 
			// 松山線
			'G21-G22': {d: 1339, l: 'G'}, 'G19-G21': {d: 1053, l: 'G'}, 'G18A-G19': {d: 1014, l: 'G'}, 'G18A-O12': {d: 1072, l: 'G'},
			'O12-R14': {d: 1315, l: 'G'}, 'G14-R14': {d: 1201, l: 'G'}, 'BL6-G14': {d: 836, l: 'G'}, 
			// 小南門線
			'BL6-G12': {d: 756, l: 'G'}, 'G12-R11': {d: 822, l: 'G'}, 
			// 新店線
			'O15-R11': {d: 1165, l: 'G'}, 'G9-O15': {d: 640, l: 'G'}, 'G7-G9': {d: 900, l: 'G'}, 'G6-G7': {d: 1560, l: 'G'},
			'G5-G6': {d: 1070, l: 'G'}, 'G4-G5': {d: 1150, l: 'G'}, 'G3-G4': {d: 850, l: 'G'}, 'G2-G3': {d: 900, l: 'G'}, 'G1-G2': {d: 1115, l: 'G'},
			// 小碧潭支線
			'G1A-G3': {d: 2500, l: 'G2'}, 
			// 文山內湖線
			'B10-BL18': {d: 600, l: 'BR'}, 'B10-B9': {d: 1010, l: 'BR'}, 'B8-B9': {d: 890, l: 'BR'}, 'B7-B8': {d: 1630, l: 'BR'}, 'B6-B7': {d: 870, l: 'BR'},
			'B5-B6': {d: 1130, l: 'BR'}, 'B4-B5': {d: 1010, l: 'BR'}, 'B3-B4': {d: 830, l: 'BR'}, 'B2-B3': {d: 1290, l: 'BR'}, 'B1-B2': {d: 1330, l: 'BR'},
			'B1-BR1': {d: 2580, l: 'BR'}, 'BR1-BR2': {d: 1480, l: 'BR'}, 'BR2-G18A': {d: 1050, l: 'BR'},'BL10-G18A': {d: 1150, l: 'BR'},
			'BL10-R08': {d: 900, l: 'BR'}, 'BR6-R08': {d: 751, l: 'BR'}, 'BR6-BR7': {d: 1130, l: 'BR'}, 'BR7-BR8': {d: 800, l: 'BR'},
			'BR8-BR9': {d: 1550, l: 'BR'}, 'BR10-BR9': {d: 750, l: 'BR'}, 'BR10-BR11': {d: 1200, l: 'BR'}, 'BR11-BR12': {d: 590, l: 'BR'}, 'BR12-BR13': {d: 805, l: 'BR'},
			// 環狀線
			'Y18-Y19': {d: 1560, l: 'Y'}, 'O3-Y18': {d: 624, l: 'Y'}, 'O3-Y16': {d: 1800, l: 'Y'}, 'BL2-Y16': {d: 1423, l: 'Y'}, 
			'BL2-Y14': {d: 952, l: 'Y'}, 'Y13-Y14': {d: 1392, l: 'Y'}, 'Y12-Y13': {d: 732, l: 'Y'}, 'Y11-Y12': {d: 635, l: 'Y'},
			'O18-Y11': {d: 1440, l: 'Y'}, 'O18-Y9': {d: 1157, l: 'Y'}, 'Y44-Y9': {d: 849, l: 'Y'}, 'Y44-Y7': {d: 1116, l: 'Y'},
			'G4-Y7': {d: 1559, l: 'Y'}
		},
		isTransfer: function(a, b) {
			if (b < a) { var tmp = a; a = b; b = tmp; }

			if (a == 'O' && b == 'O1') return false;
			if (a == 'O' && b == 'O2') return false;
			return a != b;
		}
	}
	
	pink : { 
		color : 'pink',
		path : [ {
			stations : ['新北投','北投'],
			start : [580,50],
			end : [505, 50],
	             } 
	           ]
	},
	lgreen : {
		color : 'lightgreen',
		path : [ {
			stations : ['小碧潭','七張'],
			start : [675,1580],
			end : [730, 1530],
	             } 
		]
	},
	red : {
		color : 'red',
		path : [ {
			stations : ['淡水','紅樹林', '竹圍', '關渡', '忠義', '復興崗', '北投'],
			start : [50,50],
			end : [505, 50],
		}, {
			stations : ['北投','奇岩', '唭哩岸', '石牌', '明德', '芝山', '士林', '劍潭', '圓山', '民權西路'],
			start : [505,50],
			end : [505, 650],
		}, {
			stations : ['民權西路','雙連', '中山'],
			start : [505,650],
			end : [505, 800],
		}, {
			stations : ['中山','台北車站'],
			start : [505,800],
			end : [505, 950],
		}, {
			stations : ['台北車站','台大醫院', '中正紀念堂'],
			start : [505,950],
			end : [505, 1050],
		}, {
			stations : ['中正紀念堂','東門'],
			start : [505,1050],
			end : [630, 1050],
		}, {
			stations : ['東門','大安森林公園', '大安'],
			start : [630,1050],
			end : [820, 1050],
		}, {
			stations : ['大安', '信義安和', '台北101/世貿', '象山'],
			start : [820,1050],
			end : [1240, 1050],
		}
		]
	},
	orange : {
		color : 'orange',
		path : [
			{
			stations : ['蘆洲', '三民高中', '徐匯中學', '三和國中', '三重國小', '大橋頭'],
			start : [110, 330],
			end : [430, 650],
			},
			{
			stations : ['大橋頭', '民權西路'],
			start : [430, 650],
			end : [505, 650],
			},
			{
			stations : ['民權西路', '中山國小'],
			start : [505,650],
			end : [685, 650],
			},
			{
			stations : ['中山國小', '行天宮', '松江南京'],
			start : [685, 650],
			end : [685, 800],
			},
			{
			stations : ['松江南京', '忠孝新生'],
			start : [685, 800],
			end : [685, 950],
			},
			{
			stations : ['忠孝新生', '東門'],
			start : [685, 950],
			end : [630, 1050],
			},
			{
			stations : ['東門', '古亭'],
			start : [630,1050],
			end : [581, 1138],
			},
			{
			stations : ['古亭', '頂溪'],
			start : [581, 1138],
			end : [510, 1270],
			},
			{
			stations : ['頂溪', '永安市場', '景安', '南勢角'],
			start : [510, 1270],
			end : [510, 1540],
			},
			{
			stations : ['大橋頭', '台北橋', '菜寮', '三重', '先嗇宮', '頭前庄', '新莊', '輔大'],
			start : [430, 650],
			end : [50, 1010],
			},
			{
			stations : ['輔大', '丹鳳', '迴龍'],
			start : [50,1010],
			end : [50, 1160],
			},
			]
	},
	brown : {
		color : 'brown',
		path : [
			{
			stations : ['南港展覽館', '南港軟體園區', '東湖', '葫洲', '大湖公園'],
			start : [1555, 950],
			end : [1555, 545],
			},
			{
			stations : ['大湖公園', '內湖', '文德', '港墘', '西湖', '劍南路', '大直'],
			start : [1555, 545],
			end : [1015, 545],
			},
			{
			stations : ['大直', '松山機場', '中山國中', '南京復興'],
			start : [1015, 545],
			end : [892, 800],
			},
			{
			stations : ['南京復興', '忠孝復興'],
			start : [892, 800],
			end : [820, 950],
			},
			{
			stations : ['忠孝復興', '大安'],
			start : [820, 950],
			end : [820, 1050],
			},
			{
			stations : ['大安', '科技大樓'],
			start : [820, 1050],
			end : [820, 1155],
			},
			{
			stations : ['科技大樓', '六張犁', '麟光', '辛亥', '萬芳醫院', '萬芳社區', '木柵', '動物園'],
			start : [820, 1155],
			end : [1225, 1505],
			},
			]
	},
	blue : { [
			{
			stations : ['南港展覽館', '南港', '昆陽', '後山埤', '永春', '市政府', '國父紀念館', '忠孝敦化', '忠孝復興'],
			start : [1555, 950],
			end : [820, 950],
			},
			{
			stations : ['忠孝復興', '忠孝新生'],
			start : [820, 950],
			end : [685, 955],
			},
			{
			stations : ['忠孝新生', '善導寺', '台北車站'],
			start : [685, 950],
			end : [505, 950],
			},
			{
			stations : ['台北車站', '西門'],
			start : [505, 950],
			end : [415, 950],
			},
			{
			stations : ['西門', '龍山寺', '江子翠'],
			start : [415, 950],
			end : [285, 1080],
			},
			{
			stations : ['江子翠', '新埔', '板橋', '府中', '亞東醫院', '海山', '土城', '永寧'],
			start : [285, 1080],
			end : [285, 1600],
			},
		]
	},
	green : {
		color : 'green',
		path : [
			{
			stations : ['松山', '南京三民', '台北小巨蛋', '南京復興'],
			start : [1235, 800],
			end : [892, 800],
			},
			{
			stations : ['南京復興', '松江南京'],
			start : [892, 800],
			end : [685, 800],
			},
			{
			stations : ['松江南京', '中山'],
			start : [685, 800],
			end : [505, 800],
			},
			{
			stations : ['中山', '北門'],
			start : [505, 800],
			end : [415, 800],
			},
			{
			stations : ['北門', '西門'],
			start : [415, 800],
			end : [415, 950],
			},
			{
			stations : ['西門', '小南門', '中正紀念堂'],
			start : [415, 950],
			end : [505, 1050],
			},
			{
			stations : ['中正紀念堂', '古亭'],
			start : [505, 1050],
			end : [581, 1138],
			},
			{
			stations : ['古亭', '台電大樓', '公館', '萬隆'],
			start : [581, 1138],
			end : [730, 1310],
			},
			{
			stations : ['萬隆', '景美', '大坪林', '七張'],
			start : [730, 1310],
			end : [730, 1530],
			},
			{
			stations : ['七張', '新店區公所', '新店'],
			start : [730, 1530],
			end : [1225, 1565],
			},
			]
	}

};